In [72]:
# Python version
import sys
print('Python: {}'.format(sys.version))
# scipy
import scipy
print('scipy: {}'.format(scipy.__version__))
# numpy
import numpy as np
print('numpy: {}'.format(numpy.__version__))
# matplotlib
import matplotlib.pyplot as plt
print('matplotlib: {}'.format(matplotlib.__version__)) # pandas
import pandas as pd
print('pandas: {}'.format(pandas.__version__))
# scikit-learn
import sklearn
print('sklearn: {}'.format(sklearn.__version__))

Python: 3.6.2 |Anaconda, Inc.| (default, Sep 21 2017, 18:29:43)
[GCC 4.2.1 Compatible Clang 4.0.1 (tags/RELEASE_401/final)]
scipy: 0.19.1
numpy: 1.13.1
matplotlib: 2.0.2
pandas: 0.20.3
sklearn: 0.19.0

In [73]:
myarray = numpy.array([[1, 2, 3], [4, 5, 6]])
rownames = ['a', 'b']
colnames = ['one', 'two', 'three']
mydataframe = pandas.DataFrame(myarray, index=rownames, columns=colnames) 
print(mydataframe)

   one  two  three
a    1    2      3
b    4    5      6

In [74]:
from pandas import read_csv
url = "https://goo.gl/vhm1eU"
names = ['preg', 'plas', 'pres', 'skin', 'test', 'mass', 'pedi', 'age', 'class'] 
data = read_csv(url, names=names)
print(data.shape)

(768, 9)

In [75]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [76]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [77]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.099259  0.082398 -0.642732 -0.532125
2013-01-02 -0.700045 -0.432893  1.424387 -1.421626
2013-01-03 -0.311033 -0.941615 -0.001412 -0.171472
2013-01-04 -2.202823  0.278561  0.164869 -1.474522
2013-01-05 -0.932023 -0.287287 -0.917731 -1.024170
2013-01-06 -0.694973  1.027218  0.139769 -0.142159

In [78]:
df2 = pd.DataFrame({ 'A' : 1.,
                      'B' : pd.Timestamp('20130102'),
                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                      'D' : np.array([3] * 4,dtype='int32'),
                      'E' : pd.Categorical(["test","train","test","train"]),
                      'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [79]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [80]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [81]:
df2.tail(3)

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [82]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [83]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [84]:
df.values

array([[ -1.09925942e+00,   8.23981775e-02,  -6.42731760e-01,
         -5.32125051e-01],
       [ -7.00044936e-01,  -4.32893033e-01,   1.42438671e+00,
         -1.42162588e+00],
       [ -3.11032523e-01,  -9.41614696e-01,  -1.41212432e-03,
         -1.71472319e-01],
       [ -2.20282298e+00,   2.78561192e-01,   1.64868948e-01,
         -1.47452222e+00],
       [ -9.32023007e-01,  -2.87286830e-01,  -9.17730890e-01,
         -1.02416997e+00],
       [ -6.94972888e-01,   1.02721804e+00,   1.39769205e-01,
         -1.42158913e-01]])

In [85]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.990026 -0.045603  0.027858 -0.794346
std    0.650899  0.675819  0.815632  0.598501
min   -2.202823 -0.941615 -0.917731 -1.474522
25%   -1.057450 -0.396491 -0.482402 -1.322262
50%   -0.816034 -0.102444  0.069179 -0.778148
75%   -0.696241  0.229520  0.158594 -0.261636
max   -0.311033  1.027218  1.424387 -0.142159

In [86]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.099259   -0.700045   -0.311033   -2.202823   -0.932023   -0.694973
B    0.082398   -0.432893   -0.941615    0.278561   -0.287287    1.027218
C   -0.642732    1.424387   -0.001412    0.164869   -0.917731    0.139769
D   -0.532125   -1.421626   -0.171472   -1.474522   -1.024170   -0.142159

In [87]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.532125 -0.642732  0.082398 -1.099259
2013-01-02 -1.421626  1.424387 -0.432893 -0.700045
2013-01-03 -0.171472 -0.001412 -0.941615 -0.311033
2013-01-04 -1.474522  0.164869  0.278561 -2.202823
2013-01-05 -1.024170 -0.917731 -0.287287 -0.932023
2013-01-06 -0.142159  0.139769  1.027218 -0.694973

In [88]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -0.311033 -0.941615 -0.001412 -0.171472
2013-01-02 -0.700045 -0.432893  1.424387 -1.421626
2013-01-05 -0.932023 -0.287287 -0.917731 -1.024170
2013-01-01 -1.099259  0.082398 -0.642732 -0.532125
2013-01-04 -2.202823  0.278561  0.164869 -1.474522
2013-01-06 -0.694973  1.027218  0.139769 -0.142159

In [89]:
df['A']

2013-01-01   -1.099259
2013-01-02   -0.700045
2013-01-03   -0.311033
2013-01-04   -2.202823
2013-01-05   -0.932023
2013-01-06   -0.694973
Freq: D, Name: A, dtype: float64

In [90]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.099259  0.082398 -0.642732 -0.532125
2013-01-02 -0.700045 -0.432893  1.424387 -1.421626
2013-01-03 -0.311033 -0.941615 -0.001412 -0.171472

In [91]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.700045 -0.432893  1.424387 -1.421626
2013-01-03 -0.311033 -0.941615 -0.001412 -0.171472
2013-01-04 -2.202823  0.278561  0.164869 -1.474522

In [92]:
df.loc[dates[0]]

A   -1.099259
B    0.082398
C   -0.642732
D   -0.532125
Name: 2013-01-01 00:00:00, dtype: float64

In [93]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.099259  0.082398
2013-01-02 -0.700045 -0.432893
2013-01-03 -0.311033 -0.941615
2013-01-04 -2.202823  0.278561
2013-01-05 -0.932023 -0.287287
2013-01-06 -0.694973  1.027218

In [94]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.700045 -0.432893
2013-01-03 -0.311033 -0.941615
2013-01-04 -2.202823  0.278561

In [95]:
df.loc['20130102',['A','B']]

A   -0.700045
B   -0.432893
Name: 2013-01-02 00:00:00, dtype: float64

In [96]:
df.loc[dates[0],'A']

-1.0992594229078356

In [97]:
df.at[dates[0],'A']

-1.0992594229078356

In [98]:
df.iloc[3]

A   -2.202823
B    0.278561
C    0.164869
D   -1.474522
Name: 2013-01-04 00:00:00, dtype: float64

In [99]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -2.202823  0.278561
2013-01-05 -0.932023 -0.287287

In [100]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.700045  1.424387
2013-01-03 -0.311033 -0.001412
2013-01-05 -0.932023 -0.917731

In [101]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.700045 -0.432893  1.424387 -1.421626
2013-01-03 -0.311033 -0.941615 -0.001412 -0.171472

In [102]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.082398 -0.642732
2013-01-02 -0.432893  1.424387
2013-01-03 -0.941615 -0.001412
2013-01-04  0.278561  0.164869
2013-01-05 -0.287287 -0.917731
2013-01-06  1.027218  0.139769

In [103]:
df[df.A > 0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [104]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -1.099259  0.082398 -0.642732 -0.532125    one
2013-01-02 -0.700045 -0.432893  1.424387 -1.421626    one
2013-01-03 -0.311033 -0.941615 -0.001412 -0.171472    two
2013-01-04 -2.202823  0.278561  0.164869 -1.474522  three
2013-01-05 -0.932023 -0.287287 -0.917731 -1.024170   four
2013-01-06 -0.694973  1.027218  0.139769 -0.142159  three

In [105]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.311033 -0.941615 -0.001412 -0.171472   two
2013-01-05 -0.932023 -0.287287 -0.917731 -1.024170  four

In [106]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [107]:
df['F'] = s1

In [108]:
df.at[dates[0],'A'] = 0
df.iat[0,1] = 0
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.642732  5  NaN
2013-01-02 -0.700045 -0.432893  1.424387  5  1.0
2013-01-03 -0.311033 -0.941615 -0.001412  5  2.0
2013-01-04 -2.202823  0.278561  0.164869  5  3.0
2013-01-05 -0.932023 -0.287287 -0.917731  5  4.0
2013-01-06 -0.694973  1.027218  0.139769  5  5.0

In [109]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.642732 -5  NaN
2013-01-02 -0.700045 -0.432893 -1.424387 -5 -1.0
2013-01-03 -0.311033 -0.941615 -0.001412 -5 -2.0
2013-01-04 -2.202823 -0.278561 -0.164869 -5 -3.0
2013-01-05 -0.932023 -0.287287 -0.917731 -5 -4.0
2013-01-06 -0.694973 -1.027218 -0.139769 -5 -5.0

In [110]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.642732  5  NaN  1.0
2013-01-02 -0.700045 -0.432893  1.424387  5  1.0  1.0
2013-01-03 -0.311033 -0.941615 -0.001412  5  2.0  NaN
2013-01-04 -2.202823  0.278561  0.164869  5  3.0  NaN

In [111]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.700045 -0.432893  1.424387  5  1.0  1.0

In [112]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.642732  5  5.0  1.0
2013-01-02 -0.700045 -0.432893  1.424387  5  1.0  1.0
2013-01-03 -0.311033 -0.941615 -0.001412  5  2.0  5.0
2013-01-04 -2.202823  0.278561  0.164869  5  3.0  5.0

In [113]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [114]:
df.mean()

A   -0.806816
B   -0.059336
C    0.027858
D    5.000000
F    3.000000
dtype: float64

In [136]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
# ts = ts.cumsum()
# ts.head(10)
ts.plot()

In [137]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index, columns=['A', 'B', 'C', 'D'])
df = df.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best')